In [5]:
from sqlite3 import dbapi2 as sq3
from pathlib import Path
PATHSTART="."
def get_db(dbfile):
    sqlite_db = sq3.connect(Path(PATHSTART) / dbfile)
    return sqlite_db

In [6]:
def init_db(dbfile, schema):
    """Creates the database tables."""
    db = get_db(dbfile)
    db.cursor().executescript(schema)
    db.commit()
    return db

In [7]:
from collections import OrderedDict
import pandas as pd
def make_frame(list_of_tuples, legend):
    framelist=[]
    for i, cname in enumerate(legend):
        framelist.append((cname,[e[i] for e in list_of_tuples]))
    return pd.DataFrame.from_dict(OrderedDict(framelist))

In [10]:
def make_query(sel):
    c=db.cursor().execute(sel)
    return c.fetchall()

In [14]:
db=init_db("cancont.db", "")

In [16]:
candidate_cols = [e[1] for e in make_query("PRAGMA table_info(candidates);")]
candidate_cols

['id', 'first_name', 'last_name', 'middle_name', 'party']

In [17]:
out=make_query("SELECT first_name, party FROM candidates;")
make_frame(out,['first_name', 'amount'])

     first_name amount
0          Mike      R
1        Barack      D
2       Rudolph      R
3          Mike      D
4          John      D
5          Bill      D
6        Duncan      R
7        Dennis      D
8           Ron      R
9        Joseph      D
10      Hillary      D
11         Mitt      R
12       Samuel      R
13         John      R
14          Tom      R
15  Christopher      D
16         Fred      R

In [37]:
contributor_cols = [e[1] for e in make_query("PRAGMA table_info(contributors);")]
contributor_cols

['id',
 'last_name',
 'first_name',
 'middle_name',
 'street_1',
 'street_2',
 'city',
 'state',
 'zip',
 'amount',
 'date',
 'candidate_id']

In [38]:
rem="""
DELETE FROM contributors;
"""
c=db.cursor().execute(rem)
db.commit()

In [39]:
ins="""
INSERT INTO contributors (last_name, first_name, middle_name, street_1, street_2, city, state, zip, amount, date, candidate_id) \
    VALUES (?,?,?,?,?, ?, ?, ?, ?, ?, ?);
"""

In [40]:
slines[1]

['',
 'Agee',
 'Steven',
 '',
 '549 Laurel Branch Road',
 '',
 'Floyd',
 'VA',
 '24091',
 '500.00',
 '2007-06-30',
 '16']

In [41]:
from datetime import date

fd = open("data/contributors_with_candidate_id.txt")
slines =[l.strip().split('|') for l in fd.readlines()]
print(slines)
fd.close()
for list_from_line in slines[1:]:
    last_name, first_name, middle_name, street_1, street_2, city, state, zip_code, amount, c_date, candidate_id = list_from_line[1:]
    valstoinsert = (last_name, first_name, middle_name, street_1, street_2, city, state, zip_code, int(float(amount)), datetime.fromisoformat(c_date), int(candidate_id))
    print(ins, valstoinsert)
    db.cursor().execute(ins, valstoinsert)

db.commit()

[['id', 'last_name', 'first_name', 'middle_name', 'street_1', 'street_2', 'city', 'state', 'zip', 'amount', 'date', 'candidate_id'], ['', 'Agee', 'Steven', '', '549 Laurel Branch Road', '', 'Floyd', 'VA', '24091', '500.00', '2007-06-30', '16'], ['', 'Ahrens', 'Don', '', '4034 Rennellwood Way', '', 'Pleasanton', 'CA', '94566', '250.00', '2007-05-16', '16'], ['', 'Ahrens', 'Don', '', '4034 Rennellwood Way', '', 'Pleasanton', 'CA', '94566', '50.00', '2007-06-18', '16'], ['', 'Ahrens', 'Don', '', '4034 Rennellwood Way', '', 'Pleasanton', 'CA', '94566', '100.00', '2007-06-21', '16'], ['', 'Akin', 'Charles', '', '10187 Sugar Creek Road', '', 'Bentonville', 'AR', '72712', '100.00', '2007-06-16', '16'], ['', 'Akin', 'Mike', '', '181 Baywood Lane', '', 'Monticello', 'AR', '71655', '1500.00', '2007-05-18', '16'], ['', 'Akin', 'Rebecca', '', '181 Baywood Lane', '', 'Monticello', 'AR', '71655', '500.00', '2007-05-18', '16'], ['', 'Aldridge', 'Brittni', '', '808 Capitol Square Place, SW', '', 'Washington', 'DC', '20024', '250.00', '2007-06-06', '16'], ['', 'Allen', 'John D.', '', '1052 Cannon Mill Drive', '', 'North Augusta', 'SC', '29860', '1000.00', '2007-06-11', '16'], ['', 'Allen', 'John D.', '', '1052 Cannon Mill Drive', '', 'North Augusta', 'SC', '29860', '1300.00', '2007-06-29', '16'], ['', 'Allison', 'John W.', '', 'P.O. Box 1089', '', 'Conway', 'AR', '72033', '1000.00', '2007-05-18', '16'], ['', 'Allison', 'Rebecca', '', '3206 Summit Court', '', 'Little Rock', 'AR', '72227', '1000.00', '2007-04-25', '16'], ['', 'Allison', 'Rebecca', '', '3206 Summit Court', '', 'Little Rock', 'AR', '72227', '200.00', '2007-06-12', '16'], ['', 'Altes', 'R.D.', '', '8600 Moody Road', '', 'Fort Smith', 'AR', '72903', '2300.00', '2007-06-21', '16'], ['', 'Andres', 'Dale', '', '1160 Glen Oaks Drive', '', 'West Des Moines', 'IA', '50266', '250.00', '2007-06-06', '16'], ['', 'Anthony', 'John', '', '211 Long Island Drive', '', 'Hot Springs', 'AR', '71913', '2300.00', '2007-06-12', '16'], ['', 'Arbogast', 'Robert', '', '12900 State Route 56 SE', '', 'Mount Sterling', 'OH', '43143', '500.00', '2007-04-08', '16'], ['', 'Arbogast', 'Robert', '', '12900 State Route 56 SE', '', 'Mount Sterling', 'OH', '43143', '100.00', '2007-06-22', '16'], ['', 'Ardle', 'William', '', '412 Dakota Avenue', '', 'Springfield', 'OH', '45504', '50.00', '2007-06-28', '16'], ['', 'Atiq', 'Omar', '', '7200 S Hazel Street', '', 'Pine Bluff', 'AR', '71603', '1000.00', '2007-05-18', '16'], ['', 'Atiq', 'Omar', '', '7200 S Hazel Street', '', 'Pine Bluff', 'AR', '71603', '1000.00', '2007-06-27', '16'], ['', 'Baker', 'David', '', '2550 Adamsbrooke Drive', '', 'Conway', 'AR', '72034', '2300.00', '2007-04-11', '16'], ['', 'Bancroft', 'David', '', '2934 Broderick Street', '', 'San Francisco', 'CA', '94123', '250.00', '2007-04-24', '16'], ['', 'Banks', 'Charles', '', 'P.O. Box 251310', '', 'Little Rock', 'AR', '72225', '1000.00', '2007-05-14', '16'], ['', 'Barbee', 'John', '', '516 Kellyridge Drive', '', 'Apex', 'NC', '27502', '500.00', '2007-05-23', '16'], ['', 'Buckler', 'Steve', '', '24351 Armada Dr', '', 'Dana Point', 'CA', '926291306', '50.00', '2007-07-30', '20'], ['', 'Buckler', 'Steve', '', '24351 Armada Dr', '', 'Dana Point', 'CA', '926291306', '25.00', '2007-08-16', '20'], ['', 'Buckheit', 'Bruce', '', '8904 KAREN DR', '', 'FAIRFAX', 'VA', '220312731', '100.00', '2007-09-19', '20'], ['', 'Buckel', 'Linda', '', 'PO Box 683130', '', 'Park City', 'UT', '840683130', '2300.00', '2007-08-14', '20'], ['', 'Buckel', 'Linda', '', 'PO Box 683130', '', 'Park City', 'UT', '840683130', '-2300.00', '2007-08-14', '20'], ['', 'Buckel', 'Linda', '', 'PO Box 683130', '', 'Park City', 'UT', '840683130', '4600.00', '2007-08-14', '20'], ['', 'Buck', 'Thomas', '', '4206 Terrace Street', '', 'Kansas City', 'MO', '64111', '100.00', '2007-09-25', '20'], ['', 'Buck', 'Jay', 'K.', '1855 Old Willow Rd Unit 322', '', 'Northfield', 'IL', '600932918', '200.00', '2007-09-12', '20'], ['', 'Buck', 'Blaine', 'M', '45 Eaton Ave', '', 'Camden', 'ME', '048431752', '2300.00', '2007-09-30', '20'], ['', 'Buck', 'Barbara', '', '1780 NE 138th St', '', 'North Miami', 'FL', '331811316', '50.00', '2007-09-13', '20'], ['', 'Buck', 'Barbara', '', '1780 NE 138th St', '', 'North Miami', 'FL', '331811316', '50.00', '2007-07-19', '20'], ['', 'Buchman', 'Mark M', '', '2530 Lawton Ave', '', 'San Luis Obispo', 'CA', '934015622', '460.80', '2007-07-18', '20'], ['', 'Bucher', 'Ida', 'M', '1400 Warnall Ave', '', 'Los Angeles', 'CA', '900245333', '100.00', '2007-07-10', '20'], ['', 'Buchanek', 'Elizabeth', '', '7917 Kentbury Dr', '', 'Bethesda', 'MD', '208144615', '50.00', '2007-09-30', '20'], ['', 'Buchanan', 'John', '', '2025 NW 29th Rd', '', 'Boca Raton', 'FL', '334316303', '500.00', '2007-09-24', '20'], ['', 'Buchanan', 'John', '', '2025 NW 29th Rd', '', 'Boca Raton', 'FL', '334316303', '-500.00', '2007-09-24', '20'], ['', 'Buchanan', 'John', '', '2025 NW 29th Rd', '', 'Boca Raton', 'FL', '334316303', '500.00', '2007-09-24', '20'], ['', 'Buchanan', 'John', '', '2025 NW 29th Rd', '', 'Boca Raton', 'FL', '334316303', '700.00', '2007-08-28', '20'], ['', 'Buchanan', 'John', '', '2025 NW 29th Rd', '', 'Boca Raton', 'FL', '334316303', '-700.00', '2007-08-28', '20'], ['', 'Buchanan', 'John', '', '2025 NW 29th Rd', '', 'Boca Raton', 'FL', '334316303', '1000.00', '2007-08-28', '20'], ['', 'Buchanan', 'John', '', '2025 NW 29th Rd', '', 'Boca Raton', 'FL', '334316303', '1300.00', '2007-08-09', '20'], ['', 'Buchanan', 'John', '', '2025 NW 29th Rd', '', 'Boca Raton', 'FL', '334316303', '200.00', '2007-08-14', '20'], ['', 'Buchanan', 'John', '', '2025 NW 29th Rd', '', 'Boca Raton', 'FL', '334316303', '500.00', '2007-07-25', '20'], ['', 'Buchanan', 'John', '', '4635 49th St NW', '', 'Washington', 'DC', '200164320', '200.09', '2007-09-23', '20'], ['', 'Harrison', 'Ryan', '', '2247 3rd St', '', 'La Verne', 'CA', '917504918', '25.00', '2007-07-26', '20'], ['', 'BYNUM', 'HERBERT', '', '332 SUNNYSIDE ROAD', '', 'TAMPA', 'FL', '336177249', '-500.00', '2008-03-10', '22'], ['', 'BYINGTON', 'MARGARET', 'E.', '2633 MIDDLEBORO LANE N.E.', '', 'GRAND RAPIDS', 'MI', '495061254', '-2300.00', '2008-03-03', '22'], ['', 'BYERS', 'BOB', 'A.', '13170 TELFAIR AVENUE', '', 'SYLMAR', 'CA', '913423573', '-2300.00', '2008-03-07', '22'], ['', 'BYERS', 'AUDREY', '', '2658 LADBROOK WAY', '', 'THOUSAND OAKS', 'CA', '913615073', '-200.00', '2008-03-07', '22'], ['', 'BUSH', 'KRYSTIE', '', 'P.O. BOX 61046', '', 'DENVER', 'CO', '802061046', '-2300.00', '2008-03-06', '22'], ['', 'BUSH', 'ERIC', '', 'P.O. BOX 61046', '', 'DENVER', 'CO', '802061046', '-2300.00', '2008-03-06', '22'], ['', 'BURTON', 'SUSAN', '', '9338 DEER CREEK DRIVE', '', 'TAMPA', 'FL', '336472286', '-2300.00', '2008-03-05', '22'], ['', 'BURTON', 'STEVEN', 'G.', '9938 DEER CREEK DRIVE', '', 'TAMPA', 'FL', '33647', '-2300.00', '2008-03-05', '22'], ['', 'BURTON', 'GLENN', 'M.', '4404 CHARLESTON COURT', '', 'TAMPA', 'FL', '336092620', '-2300.00', '2008-03-05', '22'], ['', 'BURKHARDT', 'CRAIG', 'S.', '910 15TH STREET N.W.', '', 'WASHINGTON', 'DC', '200052503', '-500.00', '2008-03-07', '22'], ['', 'BURKHARDT', 'CRAIG', 'S.', '910 15TH STREET N.W.', '', 'WASHINGTON', 'DC', '200052503', '-1000.00', '2008-03-07', '22'], ['', 'BURKHARDT', 'BARBARA', '', '910 15TH STREET N.W.', '', 'WASHINGTON', 'DC', '200052503', '-500.00', '2008-03-07', '22'], ['', 'BURKE', 'SUZANNE', 'M.', '3401 EVANSTON', '', 'SEATTLE', 'WA', '981038677', '-700.00', '2008-03-05', '22'], ['', 'BURKE', 'GAIL', '', '165 E. 32ND STREET', 'APARTMENT 9E', 'NEW YORK', 'NY', '100166014', '-2000.00', '2008-03-05', '22'], ['', 'BURKE', 'DONALD', 'J.', '12 LOMPOC', '', 'RANCHO SANTA MARGA', 'CA', '926881817', '-2300.00', '2008-03-11', '22'], ['', 'BURGERT', 'RONALD', 'L.', '5723 PLUMTREE DRIVE', '', 'DALLAS', 'TX', '752524926', '-1000.00', '2008-03-05', '22'], ['', 'BULL', 'BARTLE', 'B.', '439 E. 51ST STREET', '', 'NEW YORK', 'NY', '100226473', '-800.00', '2008-03-10', '22'], ['', 'BULL', 'BARTLE', 'B.', '439 E. 51ST STREET', '', 'NEW YORK', 'NY', '100226473', '-1000.00', '2008-03-10', '22'], ['', 'BUKOWSKI', 'DANIEL', 'J.', '702 S. WRIGHT STREET', '', 'NAPERVILLE', 'IL', '605406736', '-100.00', '2008-03-10', '22'], ['', 'BUISSON', 'MARGARET', 'A.', 'P.O. BOX 197029', '', 'LOUISVILLE', 'KY', '402597029', '-200.00', '2008-03-11', '22'], ['', 'BUCKLEY', 'WALTER', 'W.', '1635 COUNTRY ROAD', '', 'BETHLEHEM', 'PA', '180155718', '-100.00', '2008-03-05', '22'], ['', 'BUCKLEY', 'MARJORIE', 'B.', '1635 COUNTRY ROAD', '', 'BETHLEHEM', 'PA', '180155718', '-100.00', '2008-03-05', '22'], ['', 'BRUNO', 'JOHN', '', '10136 WINDERMERE CHASE BLVD.', '', 'GOTHA', 'FL', '347344707', '-2300.00', '2008-03-06', '22'], ['', 'BRUNO', 'IRENE', '', '10136 WINDERMERE CHASE BLVD.', '', 'GOTHA', 'FL', '347344707', '-2300.00', '2008-03-06', '22'], ['', 'BROWN', 'TIMOTHY', 'J.', '26826 MARLOWE COURT', '', 'STEVENSON RANCH', 'CA', '913811020', '-2300.00', '2008-03-06', '22'], ['', 'Schuff', 'Bryan', '', '1700 W Sweden Rd', '', 'Brockport', 'NY', '14420', '-25.00', '2008-08-22', '32'], ['', 'Hobbs', 'James', '', '229 Cherry Lane', '', 'White House', 'TN', '37188', '-25.00', '2008-08-19', '32'], ['', 'Ranganath', 'Anoop', '', '2507 Willard Drive', '', 'Charlottesville', 'VA', '22903', '-100.00', '2008-04-21', '32'], ['', 'Nystrom', 'Michael', 'A', '93A Fairmont Street', '', 'Arlington', 'MA', '02474', '-503.00', '2008-04-21', '32'], ['', 'Muse', 'Nina', 'Jo', '2915 Toro Canyon Rd', '', 'Austin', 'TX', '78746', '-50.00', '2008-04-21', '32'], ['', 'Waddell', 'James', 'L.', '1823 Spel Lane SW', '', 'Rochester', 'MN', '55902', '-28.00', '2008-04-21', '32'], ['', 'Brucks', 'William', 'C.', 'PO Box 391', '', 'Corona del Mar', 'CA', '92625', '-150.00', '2008-04-21', '32'], ['', 'Kuehn', 'David', '', '14502 West 93rd Street', '', 'Lenexa', 'KS', '66215', '-330.00', '2008-04-21', '32'], ['', 'Verster', 'Jeanette', 'M.', '7220 SW 61st St', '', 'Miami', 'FL', '331431807', '-1000.00', '2008-04-21', '32'], ['', 'Uihlein', 'Richard', '', '1396 N Waukegan Rd', '', 'Lake Forest', 'IL', '600451147', '-2300.00', '2008-04-21', '32'], ['', 'Eskenberry', 'Robert', 'P', '10960 Gray Cir', '', 'Westminster', 'CO', '80020', '-223.00', '2008-04-21', '32'], ['', 'Froehling', 'Alan', 'L.', '302 Broadway St', '', 'Mount Vernon', 'IL', '628645116', '-844.80', '2008-04-21', '32'], ['', 'Duryea', 'Marcia', 'A.', '123 Bayview Ave', '', 'Amityville', 'NY', '11701', '-299.50', '2008-04-21', '32'], ['', 'Perreault', 'Louise', '', '503 Brockridge Hunt Drive', '', 'Hampton', 'VA', '23666', '-34.08', '2008-04-21', '32'], ['', 'Rozenfeld', 'Timur', '', '57 Herbert Road', '', 'Robbinsville', 'NJ', '08691', '-777.95', '2008-04-21', '32'], ['', 'Kazor', 'Christopher', 'M', '707 Spindletree ave', '', 'Naperville', 'IL', '60565', '-2592.00', '2008-04-21', '32'], ['', 'Lehner', 'Thomas', 'S.', '2701 Star Lane', '', 'Wadsworth', 'OH', '44281', '-200.00', '2008-04-21', '32'], ['', 'Plummer', 'Joseph', '', '587 Blake Hill Rd', '', 'New Hampton', 'NH', '032564424', '-24.60', '2008-04-21', '32'], ['', 'Raught', 'Philip', 'M', '4714 Plum Way', '', 'Pittsburgh', 'PA', '15201', '-1046.00', '2008-04-21', '32'], ['', 'Ferrara', 'Judith', 'D', '1508 Waterford Road', '', 'Yardley', 'PA', '19067', '-1100.00', '2008-04-21', '32'], ['', 'Johnson', 'Cathleen', 'E.', '1003 Justin Ln Apt 2016', '', 'Austin', 'TX', '787572648', '-14.76', '2008-04-21', '32'], ['', 'Sanford', 'Bradley', '', '940 Post St #43', '', 'San Francisco', 'CA', '94109', '-24.53', '2008-04-21', '32'], ['', 'Gaarder', 'Bruce', '', 'PO Box 4085', '', 'Mountain Home AFB', 'ID', '83648', '-261.00', '2008-04-21', '32'], ['', 'Choe', 'Hyeokchan', '', '207 Bridle Way', '', 'Fort Lee', 'NJ', '070246302', '-39.50', '2008-04-21', '32'], ['', 'Jacobs', 'Richard', 'G.', '14337 Tawya Rd', '', 'Apple Valley', 'CA', '923075545', '-1000.00', '2008-04-21', '32'], ['', 'Aaronson', 'Rebecca', '', '2000 Village Green Dr Apt 12', '', 'Mill Creek', 'WA', '980125787', '100.00', '2008-02-08', '34'], ['', 'Aarons', 'Elaine', '', '481 Buck Island Rd Apt 17A', 'APT 17A', 'West Yarmouth', 'MA', '026733300', '25.00', '2008-02-26', '34'], ['', 'Aarons', 'Elaine', '', '481 Buck Island Rd Apt 17A', 'APT 17A', 'West Yarmouth', 'MA', '026733300', '70.00', '2008-02-25', '34'], ['', 'Aarons', 'Elaine', '', '481 Buck Island Rd Apt 17A', 'APT 17A', 'West Yarmouth', 'MA', '026733300', '100.00', '2008-02-08', '34'], ['', 'Aaron', 'Shirley', '', '101 Cherry Ave', '', 'Havana', 'FL', '323331311', '50.00', '2008-02-29', '34'], ['', 'Aaron', 'Shirley', '', '101 Cherry Ave', '', 'Havana', 'FL', '323331311', '100.00', '2008-02-29', '34'], ['', 'Aaronson', 'Rebecca', '', '2000 Village Green Dr Apt 12', '', 'Mill Creek', 'WA', '980125787', '100.00', '2008-02-14', '34'], ['', 'Aaron', 'Shirley', '', '101 Cherry Ave', '', 'Havana', 'FL', '323331311', '100.00', '2008-02-24', '34'], ['', 'Aaron', 'Shirley', '', '101 Cherry Ave', '', 'Havana', 'FL', '323331311', '100.00', '2008-02-22', '34'], ['', 'Aaron', 'Shirley', '', '101 Cherry Ave', '', 'Havana', 'FL', '323331311', '100.00', '2008-02-17', '34'], ['', 'Reid', 'Elizabeth', '', '73 W Patent Rd', 'OPHIR FARM NORTH', 'Bedford Hills', 'NY', '105072222', '-350.00', '2008-08-28', '34'], ['', 'Reich', 'Thomas', '', '499 Park Ave', '', 'New York', 'NY', '100221240', '-2300.00', '2008-08-28', '34'], ['', 'Aaron', 'Shirley', '', '101 Cherry Ave', '', 'Havana', 'FL', '323331311', '100.00', '2008-02-08', '34'], ['', 'Aaron', 'Shirley', '', '101 Cherry Ave', '', 'Havana', 'FL', '323331311', '100.00', '2008-02-03', '34'], ['', 'Aaron', 'Sharron', '', '1804 E Montgomery St', '', 'Broken Arrow', 'OK', '740121840', '500.00', '2008-02-09', '34'], ['', 'Aaron', 'Patricia', '', '418 NW 35th St', '', 'Oklahoma City', 'OK', '731188602', '200.00', '2008-02-26', '34'], ['', 'Aaron', 'Patricia', '', '418 NW 35th St', '', 'Oklahoma City', 'OK', '731188602', '100.00', '2008-02-12', '34'], ['', 'Aaron', 'Jim', '', '2178 Fairway Cir', '', 'Canton', 'MI', '481885097', '300.00', '2008-02-07', '34'], ['', 'Aaron', 'Jim', '', '2178 Fairway Cir', '', 'Canton', 'MI', '481885097', '200.00', '2008-02-29', '34'], ['', 'Aaron', 'Carole', '', 'PO Box 1806', '', 'Ogunquit', 'ME', '039071806', '70.00', '2008-02-29', '34'], ['', 'Aaron', 'Carole', '', 'PO Box 1806', '', 'Ogunquit', 'ME', '039071806', '50.00', '2008-02-07', '34'], ['', 'Aaron', 'Carole', '', 'PO Box 1806', '', 'Ogunquit', 'ME', '039071806', '100.00', '2008-02-03', '34'], ['', 'Aaron', 'Barbara', '', '2298 Pacific Ave # 6', '', 'San Francisco', 'CA', '941151435', '1000.00', '2008-02-11', '34'], ['', 'Aanonsen', 'Lin', '', '897 Raymond Ave', '', 'Saint Paul', 'MN', '551141508', '250.00', '2008-02-21', '34'], ['', 'Aanonsen', 'Lin', '', '897 Raymond Ave', '', 'Saint Paul', 'MN', '551141508', '100.00', '2008-02-08', '34'], ['', 'BOURNE', 'TRAVIS', '', 'LAGE KAART 77', '', 'BRASSCHATT', '', '02930', '-500.00', '2008-11-20', '35'], ['', 'SECRIST', 'BRIAN', 'L.', '3 MULE DEER TRAIL', '', 'LITTLETON', 'CO', '801275722', '-1000.00', '2008-04-07', '35'], ['', 'TOLLESTRUP', 'TRAVIS', 'W.', '16331 WINECREEK RD.', '', 'SAN DIEGO', 'CA', '92127', '-1000.00', '2008-05-15', '35'], ['', 'ACCORD', 'DEAN', 'C.', '8813 ROBINSON RIDGE ROAD', '', 'LAS VEGAS', 'NV', '891175812', '500.00', '2007-07-13', '35'], ['', 'ABTS', 'HENRY', '', 'P. O. BOX 7299', '', 'INCLINE VILLAGE', 'NV', '894527299', '100.00', '2007-07-13', '35'], ['', 'ABSHIER', 'LANNY', '', '14191 S.E. HIGHWAY 301', '', 'SUMMERFIELD', 'FL', '34491', '500.00', '2007-09-25', '35'], ['', 'ABSHIER', 'DIANA', '', '14191 S.E. HIGHWAY 301', '', 'SUMMERFIELD', 'FL', '34491', '500.00', '2007-09-25', '35'], ['', 'ABREU', 'KEVIN', 'M.', '1305 GARDEN GLEN LANE', '', 'PEARLAND', 'TX', '775816547', '50.00', '2007-09-30', '35'], ['', 'ABREU', 'KEVIN', 'M.', '1305 GARDEN GLEN LANE', '', 'PEARLAND', 'TX', '775816547', '150.00', '2007-08-09', '35'], ['', 'ABREU', 'KEVIN', 'M.', '1305 GARDEN GLEN LANE', '', 'PEARLAND', 'TX', '775816547', '50.00', '2007-07-19', '35'], ['', 'ABRAMOWITZ', 'NIRA', '', '411 HARBOR ROAD', '', 'SOUTHPORT', 'CT', '068901376', '2300.00', '2007-09-14', '35'], ['', 'ABRAMS', 'MICHAEL', '', '7910 WOODMONT AVENUE', '', 'BETHESDA', 'MD', '208143002', '250.00', '2007-09-29', '35'], ['', 'ABRAMOWITZ', 'KEN', '', '200 CENTRAL PARK S.', 'APARTMENT 31A', 'NEW YORK', 'NY', '100191448', '300.00', '2007-09-11', '35'], ['', 'ABOUBAKARE', 'NASAR', '', '1400 SAN MIGUEL DRIVE', '', 'CORONA DEL MAR', 'CA', '926251300', '1000.00', '2007-07-09', '35'], ['', 'ABEGG', 'PATRICIA', 'T.', '1862 E. 5150 S.', '', 'SALT LAKE CITY', 'UT', '841176911', '75.00', '2007-09-25', '35'], ['', 'ABEGG', 'PATRICIA', 'T.', '1862 E. 5150 S.', '', 'SALT LAKE CITY', 'UT', '841176911', '25.00', '2007-09-17', '35'], ['', 'ABEGG', 'PATRICIA', 'T.', '1862 E. 5150 S.', '', 'SALT LAKE CITY', 'UT', '841176911', '75.00', '2007-08-31', '35'], ['', 'ABEGG', 'PATRICIA', 'T.', '1862 E. 5150 S.', '', 'SALT LAKE CITY', 'UT', '841176911', '75.00', '2007-08-14', '35'], ['', 'ABEGG', 'PATRICIA', 'T.', '1862 E. 5150 S.', '', 'SALT LAKE CITY', 'UT', '841176911', '25.00', '2007-08-06', '35'], ['', 'ABEGG', 'PATRICIA', 'T.', '1862 E. 5150 S.', '', 'SALT LAKE CITY', 'UT', '841176911', '25.00', '2007-07-10', '35'], ['', 'ABDELLA', 'THOMAS', 'M.', '4231 MONUMENT WALL WAY #340', '', 'FAIRFAX', 'VA', '220308440', '50.00', '2007-09-30', '35'], ['', 'ABBOTT', 'WELDON', 'S.', '777 EAST SOUTH TEMPLE  4E', '', 'SALT LAKE CITY', 'UT', '841021269', '100.00', '2007-09-29', '35'], ['', 'ABBOTT', 'WELDON', 'S.', '777 EAST SOUTH TEMPLE  4E', '', 'SALT LAKE CITY', 'UT', '841021269', '50.00', '2007-08-09', '35'], ['', 'ABBOTT', 'GERALD', 'F.', '389 BENEFIT STREET', '', 'PROVIDENCE', 'RI', '029032946', '100.00', '2007-09-15', '35'], ['', 'ABBOTT', 'GERALD', 'F.', '389 BENEFIT STREET', '', 'PROVIDENCE', 'RI', '029032946', '100.00', '2007-08-15', '35'], ['', 'ABEDIN', 'ZAINUL', '', '715 N. CENTRAL AVENUE', 'SUITE 212', 'GLENDALE', 'CA', '912031164', '500.00', '2008-01-21', '37'], ['', 'ABBOTT', 'SYBIL', 'F.', '446 GAMES DRIVE', '', 'RENO', 'NV', '895093326', '75.00', '2008-01-08', '37'], ['', 'ABBOTT', 'SYBIL', 'F.', '446 GAMES DRIVE', '', 'RENO', 'NV', '895093326', '50.00', '2008-01-08', '37'], ['', 'ABBOTT', 'RONALD', 'LEANDER', '5453 HAWTHORNE STREET', '', 'MONTCLAIR', 'CA', '917632551', '200.00', '2008-01-31', '37'], ['', 'ABBOTT', 'RONALD', 'LEANDER', '5453 HAWTHORNE STREET', '', 'MONTCLAIR', 'CA', '917632551', '100.00', '2008-01-08', '37'], ['', 'ABBOTT', 'ROBERT', 'A.', '3061 LOREE ROAD', '', 'DECKERVILLE', 'MI', '484279763', '500.00', '2008-01-21', '37'], ['', 'ABBOTT', 'MIKE', 'E.', '4516 OSPREY LNDG', '', 'NICEVILLE', 'FL', '325786810', '1000.00', '2008-01-15', '37'], ['', 'ABBOT', 'DAVID', 'M.', '56 SALEM STREET', '', 'ANDOVER', 'MA', '018102114', '200.00', '2008-01-21', '37'], ['', 'ABBO', 'PAULINE', 'MORENCY', '10720 JACOB LANE', '', 'WHITE LAKE', 'MI', '483862274', '35.00', '2008-01-07', '37'], ['', 'ABATE', 'MARIA', 'ELENA', '1291 NIGHTINGALE AVENUE', '', 'MIAMI SPRINGS', 'FL', '331663832', '2600.00', '2008-01-25', '37'], ['', 'ABAIR', 'PETER', '', '40 EVANS STREET', '', 'WATERTOWN', 'MA', '024722150', '25.00', '2008-01-09', '37'], ['', 'ABACHERLI', 'SHIRLEY', 'M.', '29875 NEWPORT ROAD', '', 'MENIFEE', 'CA', '925849524', '150.00', '2008-01-28', '37'], ['', 'AARONS', 'CHARLES', '', '1730 SHORE DRIVE', '', 'ANCHORAGE', 'AK', '995153207', '300.00', '2008-01-30', '37'], ['', 'AARONS', 'CHARLES', '', '1730 SHORE DRIVE', '', 'ANCHORAGE', 'AK', '995153207', '410.00', '2008-01-15', '37'], ['', 'AARONS', 'CHARLES', '', '1730 SHORE DRIVE', '', 'ANCHORAGE', 'AK', '995153207', '500.00', '2008-01-09', '37'], ['', 'ABEL', 'JOHN', 'H.', '422 THOMAS STREET', '', 'BETHLEHEM', 'PA', '180153316', '200.00', '2008-01-22', '37'], ['', 'ABEL', 'MARLING', 'L.', '14 HANGING MOSS LANE', '', 'GREENVILLE', 'SC', '296155069', '100.00', '2008-01-22', '37'], ['', 'ABEL', 'RUDOLPH', '', '4532 OCEAN BLVD.', '# 108

/var/folders/td/94qngg4x2_lcb32n6td6t7540000gn/T/ipykernel_7077/125978452.py:11: DeprecationWarning: The default datetime adapter is deprecated as of Python 3.12; see the sqlite3 documentation for suggested replacement recipes
  db.cursor().execute(ins, valstoinsert)

In [42]:
out=make_query("SELECT * FROM contributors WHERE state IN ('VA', 'MA');")
make_frame(out, legend=contributor_cols)

,id,last_name,first_name,middle_name,street_1,street_2,city,state,zip,amount,date,candidate_id
0,526,Agee,Steven,,549 Laurel Branch Road,,Floyd,VA,24091,500,2007-06-30 00:00:00,16
1,553,Buckheit,Bruce,,8904 KAREN DR,,FAIRFAX,VA,220312731,100,2007-09-19 00:00:00,20
2,603,Ranganath,Anoop,,2507 Willard Drive,,Charlottesville,VA,22903,-100,2008-04-21 00:00:00,32
3,604,Nystrom,Michael,A,93A Fairmont Street,,Arlington,MA,02474,-503,2008-04-21 00:00:00,32
4,614,Perreault,Louise,,503 Brockridge Hunt Drive,,Hampton,VA,23666,-34,2008-04-21 00:00:00,32
5,627,Aarons,Elaine,,481 Buck Island Rd Apt 17A,APT 17A,West Yarmouth,MA,026733300,25,2008-02-26 00:00:00,34
6,628,Aarons,Elaine,,481 Buck Island Rd Apt 17A,APT 17A,West Yarmouth,MA,026733300,70,2008-02-25 00:00:00,34
7,629,Aarons,Elaine,,481 Buck Island Rd Apt 17A,APT 17A,West Yarmouth,MA,026733300,100,2008-02-08 00:00:00,34
8,671,ABDELLA,THOMAS,M.,4231 MONUMENT WALL WAY #340,,FAIRFAX,VA,220308440,50,2007-09-30 00:00:00,35
9,683,ABBOT,DAVID,M.,56 SALEM STREET,,ANDOVER,MA,018102114,200,2008-01-21 00:00:00,37
10,686,ABAIR,PETER,,40 EVANS STREET,,WATERTOWN,MA,024722150,25,2008-01-09 00:00:00,37

In [47]:
q = make_query("select * from contributors where last_name = 'ABREU';")
make_frame(q, contributor_cols)

,id,last_name,first_name,middle_name,street_1,street_2,city,state,zip,amount,date,candidate_id
0,658,ABREU,KEVIN,M.,1305 GARDEN GLEN LANE,,PEARLAND,TX,775816547,50,2007-09-30 00:00:00,35
1,659,ABREU,KEVIN,M.,1305 GARDEN GLEN LANE,,PEARLAND,TX,775816547,150,2007-08-09 00:00:00,35
2,660,ABREU,KEVIN,M.,1305 GARDEN GLEN LANE,,PEARLAND,TX,775816547,50,2007-07-19 00:00:00,35

This is obviously the same dude so next time we need to clean this up so that our database does not have reprting individuals under one contributor.